Tekla Open API Reference for Tekla Structures 2025
Model.GetGUIDByIdentifier Method
 Returns the GUID of the given identifier instance.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string GetGUIDByIdentifier(
	Identifier identifier
)
Public Function GetGUIDByIdentifier (
	identifier As Identifier
) As String
Parameters
identifier
Type: Tekla.Structures.Identifier
The identifier to look for in the model.
Return Value
Type: String
The GUID of the identifier.
See Also
Reference
Model Class
Tekla.Structures.Model Namespace